Tekla Open API Reference for Tekla Structures 2025
ShapeSelectionForm Properties
The ShapeSelectionForm type exposes the following members.
Properties
Name | Description
SelectedShape
 Gets or sets the selected Shape in the control.
Top
See Also
Reference
ShapeSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace